podonoghue/usbdm-eclipse-plugins/net.sourceforge.usbdm.peripherals.freescale/data/peripherals/ADC_MKV40F15.svd.xml
<!--
Devices using this peripheral: 
      MKV40F15
      MKV43F15
      MKV44F15
      MKV45F15
      MKV46F15
-->
      <peripheral>
         <?sourceFile "ADC_MKV40F15" ?>
         <name>ADC</name>
         <description>Analog to digital converter</description>
         <groupName>ADC</groupName>
         <prependToName>ADC_</prependToName>
         <headerStructName>ADC</headerStructName>
         <baseAddress>0x4005C000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0xAC</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CTRL1</name>
               <description>ADC Control Register 1</description>
               <addressOffset>0x0</addressOffset>
               <size>16</size>
               <resetValue>0x5005</resetValue>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>SMODE</name>
                     <description>ADC Scan Mode Control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>Once (single) sequential</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>001</name>
                           <description>Once parallel</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>010</name>
                           <description>Loop sequential</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>011</name>
                           <description>Loop parallel</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>100</name>
                           <description>Triggered sequential</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>101</name>
                           <description>Triggered parallel (default)</description>
                           <value>0b101</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CHNCFG_L</name>
                     <description>CHCNF (Channel Configure Low) bits</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>HLMTIE</name>
                     <description>High Limit Interrupt Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Interrupt disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Interrupt enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LLMTIE</name>
                     <description>Low Limit Interrupt Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Interrupt disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Interrupt enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ZCIE</name>
                     <description>Zero Crossing Interrupt Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Interrupt disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Interrupt enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EOSIE0</name>
                     <description>End Of Scan Interrupt Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Interrupt disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Interrupt enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SYNC0</name>
                     <description>SYNC0 Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Scan is initiated by a write to CTRL1[START0] only</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use a SYNC0 input pulse or CTRL1[START0] to initiate a scan</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>START0</name>
                     <description>START0 Conversion</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No action</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Start command is issued</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>STOP0</name>
                     <description>Stop</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Stop mode</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DMAEN0</name>
                     <description>DMA enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>DMA is not enabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>DMA is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRL2</name>
               <description>ADC Control Register 2</description>
               <addressOffset>0x2</addressOffset>
               <size>16</size>
               <resetValue>0x5044</resetValue>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>DIV0</name>
                     <description>Clock Divisor Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>SIMULT</name>
                     <description>Simultaneous mode</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Parallel scans done independently</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Parallel scans done simultaneously (default)</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CHNCFG_H</name>
                     <description>CHCNF (Channel Configure High) bits</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EOSIE1</name>
                     <description>End Of Scan Interrupt Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Interrupt disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Interrupt enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SYNC1</name>
                     <description>SYNC1 Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>B converter parallel scan is initiated by a write to CTRL2[START1] bit only</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use a SYNC1 input pulse or CTRL2[START1] bit to initiate a B converter parallel scan</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>START1</name>
                     <description>START1 Conversion</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No action</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Start command is issued</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>STOP1</name>
                     <description>Stop</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Stop mode</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DMAEN1</name>
                     <description>DMA enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>DMA is not enabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>DMA is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
