podonoghue/usbdm-eclipse-plugins/net.sourceforge.usbdm.peripherals.freescale/data/peripherals/ADC_MKV40F15.svd.xml
            <register>
               <name>ZXCTRL1</name>
               <description>ADC Zero Crossing Control 1 Register</description>
               <addressOffset>0x4</addressOffset>
               <size>16</size>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>ZCE0</name>
                     <description>Zero crossing enable 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Zero Crossing disabled</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Zero Crossing enabled for positive to negative sign change</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Zero Crossing enabled for negative to positive sign change</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Zero Crossing enabled for any sign change</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ZCE1</name>
                     <description>Zero crossing enable 1</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Zero Crossing disabled</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Zero Crossing enabled for positive to negative sign change</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Zero Crossing enabled for negative to positive sign change</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Zero Crossing enabled for any sign change</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ZCE2</name>
                     <description>Zero crossing enable 2</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Zero Crossing disabled</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Zero Crossing enabled for positive to negative sign change</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Zero Crossing enabled for negative to positive sign change</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Zero Crossing enabled for any sign change</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ZCE3</name>
                     <description>Zero crossing enable 3</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Zero Crossing disabled</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Zero Crossing enabled for positive to negative sign change</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Zero Crossing enabled for negative to positive sign change</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Zero Crossing enabled for any sign change</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ZCE4</name>
                     <description>Zero crossing enable 4</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Zero Crossing disabled</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Zero Crossing enabled for positive to negative sign change</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Zero Crossing enabled for negative to positive sign change</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Zero Crossing enabled for any sign change</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ZCE5</name>
                     <description>Zero crossing enable 5</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Zero Crossing disabled</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Zero Crossing enabled for positive to negative sign change</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Zero Crossing enabled for negative to positive sign change</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Zero Crossing enabled for any sign change</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ZCE6</name>
                     <description>Zero crossing enable 6</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Zero Crossing disabled</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Zero Crossing enabled for positive to negative sign change</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Zero Crossing enabled for negative to positive sign change</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Zero Crossing enabled for any sign change</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ZCE7</name>
                     <description>Zero crossing enable 7</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Zero Crossing disabled</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Zero Crossing enabled for positive to negative sign change</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Zero Crossing enabled for negative to positive sign change</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Zero Crossing enabled for any sign change</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ZXCTRL2</name>
               <description>ADC Zero Crossing Control 2 Register</description>
               <addressOffset>0x6</addressOffset>
               <size>16</size>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>ZCE8</name>
                     <description>Zero crossing enable 8</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Zero Crossing disabled</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Zero Crossing enabled for positive to negative sign change</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Zero Crossing enabled for negative to positive sign change</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Zero Crossing enabled for any sign change</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ZCE9</name>
                     <description>Zero crossing enable 9</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Zero Crossing disabled</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Zero Crossing enabled for positive to negative sign change</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Zero Crossing enabled for negative to positive sign change</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Zero Crossing enabled for any sign change</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ZCE10</name>
                     <description>Zero crossing enable 10</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Zero Crossing disabled</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Zero Crossing enabled for positive to negative sign change</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Zero Crossing enabled for negative to positive sign change</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Zero Crossing enabled for any sign change</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ZCE11</name>
                     <description>Zero crossing enable 11</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Zero Crossing disabled</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Zero Crossing enabled for positive to negative sign change</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Zero Crossing enabled for negative to positive sign change</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Zero Crossing enabled for any sign change</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ZCE12</name>
                     <description>Zero crossing enable 12</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Zero Crossing disabled</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Zero Crossing enabled for positive to negative sign change</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Zero Crossing enabled for negative to positive sign change</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Zero Crossing enabled for any sign change</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ZCE13</name>
                     <description>Zero crossing enable 13</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Zero Crossing disabled</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Zero Crossing enabled for positive to negative sign change</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Zero Crossing enabled for negative to positive sign change</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Zero Crossing enabled for any sign change</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ZCE14</name>
                     <description>Zero crossing enable 14</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Zero Crossing disabled</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Zero Crossing enabled for positive to negative sign change</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Zero Crossing enabled for negative to positive sign change</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Zero Crossing enabled for any sign change</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ZCE15</name>
                     <description>Zero crossing enable 15</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Zero Crossing disabled</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Zero Crossing enabled for positive to negative sign change</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Zero Crossing enabled for negative to positive sign change</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Zero Crossing enabled for any sign change</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
