podonoghue/usbdm-eclipse-plugins/net.sourceforge.usbdm.peripherals.freescale/data/peripherals/ADC_MKV40F15.svd.xml
            <register>
               <name>CLIST4</name>
               <description>ADC Channel List Register 4</description>
               <addressOffset>0xE</addressOffset>
               <size>16</size>
               <resetValue>0xFEDC</resetValue>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>SAMPLE12</name>
                     <description>Sample Field 12</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0000</name>
                           <description>Single Ended: ANA0, Differential: ANA0+, ANA1-</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0001</name>
                           <description>Single Ended: ANA1, Differential: ANA0+, ANA1-</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0010</name>
                           <description>Single Ended: ANA2, Differential: ANA2+, ANA3-</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0011</name>
                           <description>Single Ended: ANA3, Differential: ANA2+, ANA3-</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0100</name>
                           <description>Single Ended: ANA4, Differential: ANA4+, ANA5-</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0101</name>
                           <description>Single Ended: ANA5, Differential: ANA4+, ANA5-</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0110</name>
                           <description>Single Ended: ANA6, Differential: ANA6+, ANA7-</description>
                           <value>0b0110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0111</name>
                           <description>Single Ended: ANA7, Differential: ANA6+, ANA7-</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1000</name>
                           <description>Single Ended: ANB0, Differential: ANB0+, ANB1-</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1001</name>
                           <description>Single Ended: ANB1, Differential: ANB0+, ANB1-</description>
                           <value>0b1001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1010</name>
                           <description>Single Ended: ANB2, Differential: ANB2+, ANB3-</description>
                           <value>0b1010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1011</name>
                           <description>Single Ended: ANB3, Differential: ANB2+, ANB3-</description>
                           <value>0b1011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1100</name>
                           <description>Single Ended: ANB4, Differential: ANB4+, ANB5-</description>
                           <value>0b1100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1101</name>
                           <description>Single Ended: ANB5, Differential: ANB4+, ANB5-</description>
                           <value>0b1101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1110</name>
                           <description>Single Ended: ANB6, Differential: ANB6+, ANB7-</description>
                           <value>0b1110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1111</name>
                           <description>Single Ended: ANB7, Differential: ANB6+, ANB7-</description>
                           <value>0b1111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SAMPLE13</name>
                     <description>Sample Field 13</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0000</name>
                           <description>Single Ended: ANA0, Differential: ANA0+, ANA1-</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0001</name>
                           <description>Single Ended: ANA1, Differential: ANA0+, ANA1-</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0010</name>
                           <description>Single Ended: ANA2, Differential: ANA2+, ANA3-</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0011</name>
                           <description>Single Ended: ANA3, Differential: ANA2+, ANA3-</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0100</name>
                           <description>Single Ended: ANA4, Differential: ANA4+, ANA5-</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0101</name>
                           <description>Single Ended: ANA5, Differential: ANA4+, ANA5-</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0110</name>
                           <description>Single Ended: ANA6, Differential: ANA6+, ANA7-</description>
                           <value>0b0110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0111</name>
                           <description>Single Ended: ANA7, Differential: ANA6+, ANA7-</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1000</name>
                           <description>Single Ended: ANB0, Differential: ANB0+, ANB1-</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1001</name>
                           <description>Single Ended: ANB1, Differential: ANB0+, ANB1-</description>
                           <value>0b1001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1010</name>
                           <description>Single Ended: ANB2, Differential: ANB2+, ANB3-</description>
                           <value>0b1010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1011</name>
                           <description>Single Ended: ANB3, Differential: ANB2+, ANB3-</description>
                           <value>0b1011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1100</name>
                           <description>Single Ended: ANB4, Differential: ANB4+, ANB5-</description>
                           <value>0b1100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1101</name>
                           <description>Single Ended: ANB5, Differential: ANB4+, ANB5-</description>
                           <value>0b1101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1110</name>
                           <description>Single Ended: ANB6, Differential: ANB6+, ANB7-</description>
                           <value>0b1110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1111</name>
                           <description>Single Ended: ANB7, Differential: ANB6+, ANB7-</description>
                           <value>0b1111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SAMPLE14</name>
                     <description>Sample Field 14</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0000</name>
                           <description>Single Ended: ANA0, Differential: ANA0+, ANA1-</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0001</name>
                           <description>Single Ended: ANA1, Differential: ANA0+, ANA1-</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0010</name>
                           <description>Single Ended: ANA2, Differential: ANA2+, ANA3-</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0011</name>
                           <description>Single Ended: ANA3, Differential: ANA2+, ANA3-</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0100</name>
                           <description>Single Ended: ANA4, Differential: ANA4+, ANA5-</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0101</name>
                           <description>Single Ended: ANA5, Differential: ANA4+, ANA5-</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0110</name>
                           <description>Single Ended: ANA6, Differential: ANA6+, ANA7-</description>
                           <value>0b0110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0111</name>
                           <description>Single Ended: ANA7, Differential: ANA6+, ANA7-</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1000</name>
                           <description>Single Ended: ANB0, Differential: ANB0+, ANB1-</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1001</name>
                           <description>Single Ended: ANB1, Differential: ANB0+, ANB1-</description>
                           <value>0b1001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1010</name>
                           <description>Single Ended: ANB2, Differential: ANB2+, ANB3-</description>
                           <value>0b1010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1011</name>
                           <description>Single Ended: ANB3, Differential: ANB2+, ANB3-</description>
                           <value>0b1011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1100</name>
                           <description>Single Ended: ANB4, Differential: ANB4+, ANB5-</description>
                           <value>0b1100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1101</name>
                           <description>Single Ended: ANB5, Differential: ANB4+, ANB5-</description>
                           <value>0b1101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1110</name>
                           <description>Single Ended: ANB6, Differential: ANB6+, ANB7-</description>
                           <value>0b1110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1111</name>
                           <description>Single Ended: ANB7, Differential: ANB6+, ANB7-</description>
                           <value>0b1111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SAMPLE15</name>
                     <description>Sample Field 15</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0000</name>
                           <description>Single Ended: ANA0, Differential: ANA0+, ANA1-</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0001</name>
                           <description>Single Ended: ANA1, Differential: ANA0+, ANA1-</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0010</name>
                           <description>Single Ended: ANA2, Differential: ANA2+, ANA3-</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0011</name>
                           <description>Single Ended: ANA3, Differential: ANA2+, ANA3-</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0100</name>
                           <description>Single Ended: ANA4, Differential: ANA4+, ANA5-</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0101</name>
                           <description>Single Ended: ANA5, Differential: ANA4+, ANA5-</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0110</name>
                           <description>Single Ended: ANA6, Differential: ANA6+, ANA7-</description>
                           <value>0b0110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0111</name>
                           <description>Single Ended: ANA7, Differential: ANA6+, ANA7-</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1000</name>
                           <description>Single Ended: ANB0, Differential: ANB0+, ANB1-</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1001</name>
                           <description>Single Ended: ANB1, Differential: ANB0+, ANB1-</description>
                           <value>0b1001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1010</name>
                           <description>Single Ended: ANB2, Differential: ANB2+, ANB3-</description>
                           <value>0b1010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1011</name>
                           <description>Single Ended: ANB3, Differential: ANB2+, ANB3-</description>
                           <value>0b1011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1100</name>
                           <description>Single Ended: ANB4, Differential: ANB4+, ANB5-</description>
                           <value>0b1100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1101</name>
                           <description>Single Ended: ANB5, Differential: ANB4+, ANB5-</description>
                           <value>0b1101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1110</name>
                           <description>Single Ended: ANB6, Differential: ANB6+, ANB7-</description>
                           <value>0b1110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1111</name>
                           <description>Single Ended: ANB7, Differential: ANB6+, ANB7-</description>
                           <value>0b1111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SDIS</name>
               <description>ADC Sample Disable Register</description>
               <addressOffset>0x10</addressOffset>
               <size>16</size>
               <resetValue>0xF0F0</resetValue>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>DS</name>
                     <description>Disable Sample Bits</description>
                     <bitOffset>0</bitOffset>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>SAMPLEx channel is enabled for ADC scan</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>SAMPLEx channel is disabled for ADC scan and corresponding channels after SAMPLEx also doesn not occur in an ADC scan</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
