podonoghue/usbdm-eclipse-plugins/net.sourceforge.usbdm.peripherals.freescale/data/peripherals/ADC_MKV40F15.svd.xml
            <register>
               <name>STAT</name>
               <description>ADC Status Register</description>
               <addressOffset>0x12</addressOffset>
               <size>16</size>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>UNDEFINED</name>
                     <description>no description available</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HLMTI</name>
                     <description>High Limit Interrupt</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No high limit interrupt request</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>High limit exceeded, IRQ pending if CTRL1[HLMTIE] is set</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LLMTI</name>
                     <description>Low Limit Interrupt</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No low limit interrupt request</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Low limit exceeded, IRQ pending if CTRL1[LLMTIE] is set</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ZCI</name>
                     <description>Zero Crossing Interrupt</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No zero crossing interrupt request</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Zero crossing encountered, IRQ pending if CTRL1[ZCIE] is set</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EOSI0</name>
                     <description>End of Scan Interrupt</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>A scan cycle has not been completed, no end of scan IRQ pending</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>A scan cycle has been completed, end of scan IRQ pending</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EOSI1</name>
                     <description>End of Scan Interrupt</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>A scan cycle has not been completed, no end of scan IRQ pending</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>A scan cycle has been completed, end of scan IRQ pending</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CIP1</name>
                     <description>Conversion in Progress</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Idle state</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>A scan cycle is in progress. The ADC will ignore all sync pulses or start commands</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CIP0</name>
                     <description>Conversion in Progress</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Idle state</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>A scan cycle is in progress. The ADC will ignore all sync pulses or start commands</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RDY</name>
               <description>ADC Ready Register</description>
               <addressOffset>0x14</addressOffset>
               <size>16</size>
               <access>read-only</access>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>RDY</name>
                     <description>Ready Sample</description>
                     <bitOffset>0</bitOffset>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Sample not ready or has been read</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Sample ready to be read</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>LOLIMSTAT</name>
               <description>ADC Low Limit Status Register</description>
               <addressOffset>0x16</addressOffset>
               <size>16</size>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>LLS</name>
                     <description>Low Limit Status Bits</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>HILIMSTAT</name>
               <description>ADC High Limit Status Register</description>
               <addressOffset>0x18</addressOffset>
               <size>16</size>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>HLS</name>
                     <description>High Limit Status Bits</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>ZXSTAT</name>
               <description>ADC Zero Crossing Status Register</description>
               <addressOffset>0x1A</addressOffset>
               <size>16</size>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>ZCS</name>
                     <description>Zero Crossing Status</description>
                     <bitOffset>0</bitOffset>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Either: A sign change did not occur in a comparison between the current channelx result and the previous channelx result, or Zero crossing control is disabled for channelx in the zero crossing control register, ZXCTRL</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>In a comparison between the current channelx result and the previous channelx result, a sign change condition occurred as defined in the zero crossing control register (ZXCTRL)</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>2</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
               <name>RSLT%s</name>
               <description>ADC Result Registers with sign extension</description>
               <addressOffset>0x1C</addressOffset>
               <size>16</size>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>RSLT</name>
                     <description>Digital Result of the Conversion</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>SEXT</name>
                     <description>Sign Extend</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>2</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
               <name>LOLIM%s</name>
               <description>ADC Low Limit</description>
               <addressOffset>0x3C</addressOffset>
               <size>16</size>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>LLMT</name>
                     <description>Low Limit Bits</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>2</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
               <name>HILIM%s</name>
               <description>ADC High Limit</description>
               <addressOffset>0x5C</addressOffset>
               <size>16</size>
               <resetValue>0x7FF8</resetValue>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>HLMT</name>
                     <description>High Limit Bits</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>2</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
               <name>OFFST%s</name>
               <description>ADC Offset</description>
               <addressOffset>0x7C</addressOffset>
               <size>16</size>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>OFFSET</name>
                     <description>ADC Offset Bits</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWR</name>
               <description>ADC Power Control Register</description>
               <addressOffset>0x9C</addressOffset>
               <size>16</size>
               <resetValue>0x1DA7</resetValue>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>PD0</name>
                     <description>Manual Power Down for Converter A</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Power Up ADC converter A</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Power Down ADC converter A</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PD1</name>
                     <description>Manual Power Down for Converter B</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Power Up ADC converter B</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Power Down ADC converter B</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>APD</name>
                     <description>Auto Powerdown</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Auto Powerdown Mode is not active</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Auto Powerdown Mode is active</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PUDELAY</name>
                     <description>Power Up Delay</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>PSTS0</name>
                     <description>ADC Converter A Power Status</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>ADC Converter A is currently powered up</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>ADC Converter A is currently powered down</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PSTS1</name>
                     <description>ADC Converter B Power Status</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>ADC Converter B is currently powered up</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>ADC Converter B is currently powered down</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ASB</name>
                     <description>Auto Standby</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Auto standby mode disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Auto standby mode enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CAL</name>
               <description>ADC Calibration Register</description>
               <addressOffset>0x9E</addressOffset>
               <size>16</size>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>SEL_VREFLO_A</name>
                     <description>Select V REFLO Source</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>VREFL pad</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>ANA3</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SEL_VREFH_A</name>
                     <description>Select V REFH Source</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>VREFH pad</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>ANA2</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SEL_VREFLO_B</name>
                     <description>Select V REFLO Source</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>VREFL pad</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>ANB3</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SEL_VREFH_B</name>
                     <description>Select V REFH Source</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>VREFH pad</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>ANB2</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
