podonoghue/usbdm-eclipse-plugins/net.sourceforge.usbdm.peripherals.freescale/data/peripherals/ADC_MKV40F15.svd.xml
            <register>
               <name>GC1</name>
               <description>Gain Control 1 Register</description>
               <addressOffset>0xA0</addressOffset>
               <size>16</size>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>GAIN0</name>
                     <description>Gain Control Bit 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>x1 amplification</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>x2 amplification</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>x4 amplification</description>
                           <value>0b10</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GAIN1</name>
                     <description>Gain Control Bit 1</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>x1 amplification</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>x2 amplification</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>x4 amplification</description>
                           <value>0b10</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GAIN2</name>
                     <description>Gain Control Bit 2</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>x1 amplification</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>x2 amplification</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>x4 amplification</description>
                           <value>0b10</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GAIN3</name>
                     <description>Gain Control Bit 3</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>x1 amplification</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>x2 amplification</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>x4 amplification</description>
                           <value>0b10</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GAIN4</name>
                     <description>Gain Control Bit 4</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>x1 amplification</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>x2 amplification</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>x4 amplification</description>
                           <value>0b10</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GAIN5</name>
                     <description>Gain Control Bit 5</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>x1 amplification</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>x2 amplification</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>x4 amplification</description>
                           <value>0b10</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GAIN6</name>
                     <description>Gain Control Bit 6</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>x1 amplification</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>x2 amplification</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>x4 amplification</description>
                           <value>0b10</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GAIN7</name>
                     <description>Gain Control Bit 7</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>x1 amplification</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>x2 amplification</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>x4 amplification</description>
                           <value>0b10</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>GC2</name>
               <description>Gain Control 2 Register</description>
               <addressOffset>0xA2</addressOffset>
               <size>16</size>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>GAIN8</name>
                     <description>Gain Control Bit 8</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>x1 amplification</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>x2 amplification</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>x4 amplification</description>
                           <value>0b10</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GAIN9</name>
                     <description>Gain Control Bit 9</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>x1 amplification</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>x2 amplification</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>x4 amplification</description>
                           <value>0b10</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GAIN10</name>
                     <description>Gain Control Bit 10</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>x1 amplification</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>x2 amplification</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>x4 amplification</description>
                           <value>0b10</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GAIN11</name>
                     <description>Gain Control Bit 11</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>x1 amplification</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>x2 amplification</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>x4 amplification</description>
                           <value>0b10</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GAIN12</name>
                     <description>Gain Control Bit 12</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>x1 amplification</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>x2 amplification</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>x4 amplification</description>
                           <value>0b10</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GAIN13</name>
                     <description>Gain Control Bit 13</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>x1 amplification</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>x2 amplification</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>x4 amplification</description>
                           <value>0b10</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GAIN14</name>
                     <description>Gain Control Bit 14</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>x1 amplification</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>x2 amplification</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>x4 amplification</description>
                           <value>0b10</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GAIN15</name>
                     <description>Gain Control Bit 15</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>x1 amplification</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>x2 amplification</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>x4 amplification</description>
                           <value>0b10</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCTRL</name>
               <description>ADC Scan Control Register</description>
               <addressOffset>0xA4</addressOffset>
               <size>16</size>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>SC</name>
                     <description>Scan Control Bits</description>
                     <bitOffset>0</bitOffset>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Perform sample immediately after the completion of the current sample</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Delay sample until a new sync input occurs</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWR2</name>
               <description>ADC Power Control Register</description>
               <addressOffset>0xA6</addressOffset>
               <size>16</size>
               <resetValue>0x400</resetValue>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>SPEEDA</name>
                     <description>ADCA Speed Control Bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Conversion clock frequency &lt;= 6.25 MHz; current consumption per converter = 6 mA</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Conversion clock frequency &lt;= 12.5 MHz; current consumption per converter = 10.8 mA</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Conversion clock frequency &lt;= 18.75 MHz; current consumption per converter = 18 mA</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Conversion clock frequency &lt;= 25 MHz; current consumption per converter = 25.2 mA</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SPEEDB</name>
                     <description>ADCB Speed Control Bits</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Conversion clock frequency &lt;= 6.25 MHz; current consumption per converter = 6 mA</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Conversion clock frequency &lt;= 12.5 MHz; current consumption per converter = 10.8 mA</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Conversion clock frequency &lt;= 18.75 MHz; current consumption per converter = 18 mA</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Conversion clock frequency &lt;= 25 MHz; current consumption per converter = 25.2 mA</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIV1</name>
                     <description>Clock Divisor Select</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
