podonoghue/usbdm-eclipse-plugins/net.sourceforge.usbdm.peripherals.freescale/data/peripherals/ADC_MKV40F15.svd.xml
            <register>
               <name>CTRL3</name>
               <description>ADC Control Register 3</description>
               <addressOffset>0xA8</addressOffset>
               <size>16</size>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>SCNT0</name>
                     <description>Sample Window Count 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SCNT1</name>
                     <description>Sample Window Count 1</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>DMASRC</name>
                     <description>DMA Trigger Source</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>DMA trigger source is end of scan interrupt</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>DMA trigger source is RDY bits</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCHLTEN</name>
               <description>ADC Scan Interrupt Enable Register</description>
               <addressOffset>0xAA</addressOffset>
               <size>16</size>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>SCHLTEN</name>
                     <description>Scan Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Scan interrupt is not enabled for this sample</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Scan interrupt is enabled for this sample</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
